package config

const AccessTokenExpire = 15 * 60

var LocationList = []string{
	// 본관
	"본관 교무실",
	"본관 교무실",
	"1-1 교실",
	"1-2 교실",
	"1-3 교실",
	"1-4 교실",
	"1-5 교실",
	"1-6 교실",
	"2-1 교실",
	"2-2 교실",
	"2-3 교실",
	"2-4 교실",
	"2-5 교실",
	"2-6 교실",
	"법인사무실",

	// 신관
	"신관 교무실",
	"디미카페",
	"다목적 학습실",
	"열람실",
	"3-1 교실",
	"3-2 교실",
	"3-3 교실",
	"3-4 교실",
	"3-5 교실",
	"3-6 교실",

	// 기타
	"운동장",
	"체육관",
	"실외 공간",
	"기타 장소",
}

var ReportCategoryList = []string{
	"욕설/비방/명예훼손",
	"음란물/선정성",
	"개인정보 유출",
	"혐오 표현",
	"폭력/자해/자살",
	"도배/스팸",
	"저작권 침해",
	"이미지와 다른 장소",
	"기타",
}
